jmeter/test2-stress.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  ChatFlow — Stress Test
  =======================
  500 concurrent users (150 WS writers + 350 HTTP /metrics readers)
  Duration: 30 minutes | Ramp-up: 120 s | Write:Read ratio = 30:70
  Writes defined as: WS TEXT send → server ACK (RECEIVED) → message confirmed in DB via /metrics poll
  Reads defined as: GET /metrics?roomId=R&startTime=now-100ms&endTime=now (~5 msgs/read)
  Target ~360K: both groups avg 2.5 s think time → 194 calls/s × 1800 s ≈ 360K total (108K writes + 252K reads)
  HikariCP: 140 /metrics calls/s × 8 connections × ~5 ms hold ≈ 5.6 avg connections (pool-10 safe)

  BEFORE RUNNING:
    1. Verify SQS queues are empty (ApproximateNumberOfMessages = 0 in CloudWatch)
    2. TRUNCATE TABLE messages in RDS if you want a clean DB start
    3. Run non-GUI:
         jmeter -n -t test2-stress.jmx -l stress-results.jtl -e -o stress-report/
    4. Monitor CloudWatch: EC2 CPU, SQS queue depth, RDS connections during run
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="ChatFlow Stress Test — 500 users, 30 min" enabled="true">
      <stringProp name="TestPlan.comments">
        150 WS writers (TEXT msgs, reuse connection) +
        350 HTTP /metrics readers (DB reads, 100 ms window, ~5 msgs per call).
        Target ~360K calls: avg 2.5 s think time → 194 calls/s × 1800 s (108K writes + 252K reads).
        140 /metrics calls/s × 8 connections × ~5 ms hold ≈ 5.6 avg HikariCP connections.
        Write definition: WS TEXT send → RECEIVED ACK → 500 ms propagation delay →
        GET /metrics (roomId + userId + write window) → assert message in DB response.
        Read definition: GET /metrics 100 ms window → assert HTTP 200.
        Target: expose EC2 CPU ceiling and SQS queue depth behaviour at 30 min.
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments"
                   testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <!-- *** UPDATE THIS to your ALB DNS *** -->
          <elementProp name="ALB_HOST" elementType="Argument">
            <stringProp name="Argument.name">ALB_HOST</stringProp>
            <stringProp name="Argument.value">6650A2-476604144.us-west-2.elb.amazonaws.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ALB_PORT" elementType="Argument">
            <stringProp name="Argument.name">ALB_PORT</stringProp>
            <stringProp name="Argument.value">80</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- Cookie manager: persists ALB sticky-session LB cookie across HTTP requests -->
      <CookieManager guiclass="CookiePanel" testclass="CookieManager"
                     testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>

      <!-- ================================================================
           Thread Group 1: WebSocket Writers  (150 threads = 30%)
           Each thread: connect → send JOIN once → loop TEXT for 30 min
           Think time: 100–300 ms (avg 200 ms) — more aggressive than baseline
           Expected WS write rate: ~150 / 0.2s ≈ 750 msg/s sustained
           ================================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="WS Writers (150 threads)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlGui" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">150</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">1800</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- Runs exactly once per thread lifetime: set vars, open WS, send JOIN -->
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController"
                            testname="Init + Connect + JOIN (once per thread)" enabled="true"/>
        <hashTree>

          <!-- Assign a stable userId, username, roomId for this thread's session -->
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler"
                         testname="Init Thread Variables" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
import java.time.Instant
import java.util.Random

def rand = new Random()

// userId: numeric string 1–100000 (server validates this range)
vars.put("userId", String.valueOf(rand.nextInt(100000) + 1))

// username: "user" + 4-digit suffix → "user1000"–"user9999" (8 alphanumeric chars, valid: 3–20)
vars.put("username", "user" + String.format("%04d", rand.nextInt(9000) + 1000))

// roomId: 1–20 (server constraint); stays fixed for this thread's session
vars.put("roomId", String.valueOf(rand.nextInt(20) + 1))

// seed timestamp; updated by pre-processor before each TEXT send
vars.put("ts", Instant.now().toString())
            </stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Sampler>
          <hashTree/>

          <!-- Open and hold the WebSocket connection for the thread's lifetime -->
          <eu.luminis.jmeter.wssampler.OpenWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler"
              testname="WS Open Connection" enabled="true">
            <stringProp name="server">${ALB_HOST}</stringProp>
            <stringProp name="port">${ALB_PORT}</stringProp>
            <stringProp name="path">/chat/${roomId}</stringProp>
            <stringProp name="connectTimeout">20000</stringProp>
            <stringProp name="readTimeout">6000</stringProp>
            <boolProp name="TLS">false</boolProp>
          </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
          <hashTree/>

          <!-- Send JOIN once; read server ACK; assert RECEIVED -->
          <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler
              guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerUI"
              testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler"
              testname="WS Send JOIN + Read ACK" enabled="true">
            <boolProp name="reuseConnection">true</boolProp>
            <boolProp name="TLS">false</boolProp>
            <stringProp name="server">${ALB_HOST}</stringProp>
            <stringProp name="port">${ALB_PORT}</stringProp>
            <stringProp name="path">/chat/${roomId}</stringProp>
            <stringProp name="connectTimeout">20000</stringProp>
            <stringProp name="readTimeout">6000</stringProp>
            <stringProp name="requestData">{"userId":"${userId}","username":"${username}","message":"joined room ${roomId}","timestamp":"${ts}","messageType":"JOIN","roomId":${roomId}}</stringProp>
            <stringProp name="dataType">Text</stringProp>
          </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                               testname="Assert JOIN ACK = RECEIVED" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1">RECEIVED</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">JOIN: server did not return RECEIVED ACK</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
          </hashTree>

        </hashTree>

        <!-- Each loop iteration: refresh timestamp, send TEXT, read ACK, assert RECEIVED -->
        <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler
            guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerUI"
            testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler"
            testname="WS Send TEXT + Read ACK" enabled="true">
          <boolProp name="reuseConnection">true</boolProp>
          <boolProp name="TLS">false</boolProp>
          <stringProp name="server">${ALB_HOST}</stringProp>
          <stringProp name="port">${ALB_PORT}</stringProp>
          <stringProp name="path">/chat/${roomId}</stringProp>
          <stringProp name="connectTimeout">20000</stringProp>
          <stringProp name="readTimeout">6000</stringProp>
          <stringProp name="requestData">{"userId":"${userId}","username":"${username}","message":"Stress test msg ${__counter(FALSE,)}","timestamp":"${ts}","messageType":"TEXT","roomId":${roomId}}</stringProp>
          <stringProp name="dataType">Text</stringProp>
        </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
        <hashTree>
          <!-- Refresh timestamp (ISO-8601 UTC) before each send; capture writeStartTime for DB verification -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                              testname="Refresh Timestamp" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
long now = System.currentTimeMillis()
vars.put("ts", java.time.Instant.ofEpochMilli(now).toString())
vars.put("writeStartTime", String.valueOf(now))
            </stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert TEXT ACK = RECEIVED" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">RECEIVED</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">TEXT: server did not return RECEIVED ACK</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
        </hashTree>

        <!-- 500 ms delay to allow async SQS → consumer → DB write to propagate -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="DB Write Propagation Delay (500 ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- Write definition: message successfully written to DB.
             Queries /metrics scoped to this user + room + write window.
             Assertion failure means the message was not persisted → write failed. -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /metrics — Verify DB Write" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="roomId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">roomId</stringProp>
                <stringProp name="Argument.value">${roomId}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="userId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">userId</stringProp>
                <stringProp name="Argument.value">${userId}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="startTime" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">startTime</stringProp>
                <stringProp name="Argument.value">${writeStartTime}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="endTime" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">endTime</stringProp>
                <stringProp name="Argument.value">${writeEndTime}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ALB_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${ALB_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/metrics</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- writeEndTime = now (after propagation delay); used as upper bound of query window -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                              testname="Set Write Verification Window" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">vars.put("writeEndTime", String.valueOf(System.currentTimeMillis()))</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert DB Write — HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">DB write check: /metrics did not return HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Presence of userId in response proves this user's message reached the DB -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert DB Write — message in response" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">${userId}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">DB write check: userId=${userId} not found in /metrics response — message not persisted</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
        </hashTree>

        <!-- Think time 1500–2500 ms (avg 2000 ms; reduced by 500 ms to offset propagation delay)
             150 threads ÷ 2.5 s = 60 msg/s × 1800 s = 108K WS calls -->
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer"
                            testname="WS Think Time (1500–2500 ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">1500</stringProp>
          <stringProp name="RandomTimer.range">1000</stringProp>
        </UniformRandomTimer>
        <hashTree/>

      </hashTree>

      <!-- ================================================================
           Thread Group 2: HTTP /metrics Readers  (350 threads = 70%)
           READ definition: GET /metrics?roomId=R&startTime=now-100&endTime=now
           → 100 ms window × ~50 msg/s per room = ~5 messages returned per call.
           /metrics fires 8 parallel DB queries per call.
           350 threads ÷ 4 s avg think time = 87.5 calls/s
           → 87.5 × 8 connections × ~5 ms hold ≈ 3.5 avg HikariCP connections (pool-10 safe)
           ================================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="HTTP /metrics Readers (350 threads)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlGui" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">350</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">1800</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /metrics (100 ms window)" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <!-- roomId: random 1–20 per iteration, spread read load across rooms -->
              <elementProp name="roomId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">roomId</stringProp>
                <stringProp name="Argument.value">${metricsRoomId}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <!-- userId: random 1–100000 per iteration (used by Q2/Q4 inside /metrics) -->
              <elementProp name="userId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">userId</stringProp>
                <stringProp name="Argument.value">${metricsUserId}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <!-- 100 ms window: at ~50 msg/s per room, returns ~5 messages (Q1) -->
              <elementProp name="startTime" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">startTime</stringProp>
                <stringProp name="Argument.value">${metricsStartTime}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="endTime" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">endTime</stringProp>
                <stringProp name="Argument.value">${metricsEndTime}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ALB_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${ALB_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/metrics</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Compute fresh 100 ms window + random roomId/userId before every call -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                              testname="Compute Metrics Window" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
import java.util.Random
def rand = new Random()
long now = System.currentTimeMillis()
vars.put("metricsEndTime",   String.valueOf(now))
vars.put("metricsStartTime", String.valueOf(now - 100))
vars.put("metricsRoomId",    String.valueOf(rand.nextInt(20) + 1))
vars.put("metricsUserId",    String.valueOf(rand.nextInt(100000) + 1))
            </stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">/metrics did not return HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
        </hashTree>

        <!-- Think time 2000–3000 ms (avg 2500 ms)
             350 threads ÷ 2.5 s = 140 calls/s × 1800 s = 252K reads -->
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer"
                            testname="HTTP Think Time (2000–3000 ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">2000</stringProp>
          <stringProp name="RandomTimer.range">1000</stringProp>
        </UniformRandomTimer>
        <hashTree/>

      </hashTree>

      <!-- ================================================================
           Listeners
           - Aggregate Report  → stress-results.jtl  (use for HTML report)
           - Summary Report    → console + file
           - View Results Tree → DISABLED; enable only for small debug runs
           ================================================================ -->
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                       testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">stress-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                       testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">stress-summary.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- Enable this temporarily to debug message format errors (max ~50 threads) -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                       testname="View Results Tree (DISABLED — debug only)" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>